app/views/assignments/show.html.erb

SELECT "tasks".* FROM "tasks"
---

          <% if not @assignment.tasks.empty? %>