app/views/groups/show.html.erb

<% if Membership.membership_exists?(current_user.id, @group.id) %>
  <%= link_to 'Leave the group', membership_path(Membership.find_mem(current_user, @group.id)), method: :delete, class:'btn btn-warning' %>
---
SELECT  "memberships".* FROM "memberships" WHERE "memberships"."user_id" = ? AND "memberships"."group_id" = ?  ORDER BY "memberships"."id" ASC LIMIT 1  [["user_id", 7], ["group_id", 1]]