app/views/users/show.html.erb

SELECT "groups".* FROM "groups" INNER JOIN "memberships" ON "groups"."id" = "memberships"."group_id" WHERE "memberships"."user_id" = ?  [["user_id", 1]]
---
    <tbody>
        <% @user.groups.each do |group| %>

SELECT "assignments".* FROM "assignments" INNER JOIN "user_assignments" ON "assignments"."id" = "user_assignments"."assignment_id" WHERE "user_assignments"."user_id" = ?  [["user_id", 1]]
---
  <tbody>
  <% @user.assignments.each do |assignment| %>

SELECT "tasks".* FROM "tasks" WHERE "tasks"."assignment_id" = ?  [["assignment_id", 11]]
---
            <tbody>
            <% assignment.tasks.each do |task| %>