app/controllers/assignments_controller.rb

  def show
    @tasks = Task.all
---
SELECT "tasks".* FROM "tasks"