app/controllers/assignments_controller.rb

  def index
    @assignments = current_user.assignments


    if @assignments.count == 0
---
SELECT COUNT(*) FROM "assignments" INNER JOIN "user_assignments" ON "assignments"."id" = "user_assignments"."assignment_id" WHERE "user_assignments"."user_id" = ?  [["user_id", 9]]

  def new

    if User.all_who_are_in_same_group_as_creator(current_user).empty? # user not in any group
---
SELECT "users".* FROM "users" WHERE 1=0
SELECT COUNT(*) FROM "users" WHERE 1=0

  def create
    @assignment = Assignment.new(assignment_params)
    @assignment.creator_id = current_user.id

    # THIS IS ONLY FOR CREATING ASSIGNMENT FOR THE VERY FIRST TIME
    # if users wants to add more users to this, edit should be used and user_assignment_controller for it
    respond_to do |format|
      if @assignment.save
        current_user.assignments << @assignment
        @assignment.update_attribute(:is_done, false)
        @assignment.user_assignments.first.update_attribute(:assignment_id, @assignment.id) # for each?
---
INSERT INTO "assignments" ("name", "deadline", "creator_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Tee rorii taas"], ["deadline", "2015-03-25 17:26:00.000000"], ["creator_id", 9], ["created_at", "2015-03-25 17:26:43.686199"], ["updated_at", "2015-03-25 17:26:43.686199"]]
SELECT  "user_assignments".* FROM "user_assignments" WHERE "user_assignments"."assignment_id" = ?  ORDER BY "user_assignments"."id" ASC LIMIT 1  [["assignment_id", 10]]
SELECT "users".* FROM "users" INNER JOIN "user_assignments" ON "users"."id" = "user_assignments"."user_id" WHERE "user_assignments"."assignment_id" = ?  [["assignment_id", 10]]

  def destroy
    if current_user.id != @assignment.creator_id
      redirect_to request.env['HTTP_REFERER'] || :root, notice: 'You are not authorized to delete assignments'
      return
    end

    @assignment.destroy
---
DELETE FROM "user_assignments" WHERE "user_assignments"."id" = ?  [["id", 1]]

    def set_assignment
      @assignment = Assignment.find(params[:id])
---
SELECT "user_assignments".* FROM "user_assignments" WHERE "user_assignments"."assignment_id" = ?  [["assignment_id", 11]]