app/controllers/groups_controller.rb

  def show
    @membership = Membership.new
    @membership.group = @group
---
SELECT  "groups".* FROM "groups" WHERE "groups"."id" = ? LIMIT 1  [["id", 1]]

  def create
    @group = Group.new(group_params)

    respond_to do |format|
      if @group.save
---
INSERT INTO "groups" ("name", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "TestGroup"], ["description", "This is a initial group"], ["created_at", "2015-03-13 11:10:23.730258"], ["updated_at", "2015-03-13 11:10:23.730258"]]