app/controllers/memberships_controller.rb

  def create
    @membership = Membership.new(membership_params)

    if Membership.membership_exists?(@membership.user_id, @membership.group_id)
      return respond_to do |format|
        format.html { redirect_to :back, notice: "You are allready in this group!"}
        format.json { render json: @membership, status: :unprocessable_entity }
      end
    end

    respond_to do |format|
      if @membership.save
---
SELECT  "memberships".* FROM "memberships" WHERE "memberships"."user_id" = ? AND "memberships"."group_id" = ?  ORDER BY "memberships"."id" ASC LIMIT 1  [["user_id", 7], ["group_id", 1]]
INSERT INTO "memberships" ("user_id", "group_id") VALUES (?, ?)  [["user_id", 7], ["group_id", 2]]

  def destroy
    Membership.find(params[:id]).destroy
---
DELETE FROM "memberships" WHERE "memberships"."id" = ?  [["id", 12]]
SELECT  "memberships".* FROM "memberships" WHERE "memberships"."id" = ? LIMIT 1  [["id", 12]]