app/controllers/tasks_controller.rb

INSERT INTO "tasks" ("name", "description", "location", "assignment_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    @task = Task.new(task_params)

    respond_to do |format|
      if @task.save