app/controllers/users_controller.rb

  def index
    @users = User.all.includes(:groups).all
---
SELECT "users".* FROM "users"

  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("name", "birthdate", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Kristian"], ["birthdate", "2015-03-09"], ["created_at", "2015-03-09 21:03:20.360698"], ["updated_at", "2015-03-09 21:03:20.360698"]]