app/controllers/user_assignments_controller.rb

  def new
    @user_assignment = UserAssignment.new()
    @users = User.all
---
SELECT "users".* FROM "users"