app/controllers/welcome_controller.rb

  def index
    if current_user.nil?
      @groups = []
    else
      @groups = current_user.groups
---
SELECT "groups".* FROM "groups" INNER JOIN "memberships" ON "groups"."id" = "memberships"."group_id" WHERE "memberships"."user_id" = ?  [["user_id", 1]]